/* Array to store the hotel room types description for later use */




/* Tips

    Don't use شقة or فرفة in the hotelRoomDescription

    Instead use روم 

*/
let hotelRoomTypesDescriptionArray = [
    /* Keramas */
    {
        hotelName: 'Komaneka Keramas',
        hotelRoomTypes: ['فيلا اوشن مع مسبح خاص وإطلالة على المحيط', 'فيلا هيلتوب مع مسبح خاص وإطلالة على المحيط'],
    },





    /* Ubud */
    {
        hotelName: 'Komaneka Tanggayuda',
        hotelRoomTypes: ['فيلا فالي مع مسبح خاص بإطلالة على الطبيعة', 'فيلا بريمير فالي مع مسبح خاص بإطلالة على الطبيعة'],
    },
    {
        hotelName: 'Samsara Ubud',
        hotelRoomTypes: ['فيلا ديلوكس مع مسبح خاص وإطلالة على الطبيعة', 'فيلا مع مسبح خاص بإطلالة على الطبيعة'],
    },
    {
        hotelName: 'Tejaprana',
        hotelRoomTypes: ['فيلا فالي مع مسبح خاص بإطلالة على الطبيعة', 'فيلا تراس مع مسبح خاص بإطلالة على الطبيعة'],
    },
    {
        hotelName: 'K Club',
        hotelRoomTypes: ['فيلا بادي فاخرة مع مسبح خاص بإطلالة علئ الطبيعة', 'فيلا فاخرة مع مسبح خاص بإطلالة على حقول الارز'],
    },
    {
        hotelName: 'Ulaman Eco Luxury',
        hotelRoomTypes: ['Cocoon upper deluxe'],
    },
    {
        hotelName: 'Aksari Ubud',
        hotelRoomTypes: ['فيلا مع مسبح خاص بإطلاله علئ النهر'],
    },





    /* Nusa Dua */
    {
        hotelName: 'Ulu Segara',
        hotelRoomTypes: ['جناح مطل على المحيط', 'سويت اوشن روم بإطلالة على المحيط', 'فيلا اوشن مع مسبح خاص بإطلالة على المحيط', 'فيلا مع مسبح خاص باطلالة على المحيط', 'جناح اوشن بإطلالة على المحيط', 'فيلا مع مسبح خاص'],
    },
    {
        hotelName: 'Merusaka',
        hotelRoomTypes: ['ديلوكس روم', 'ديلوكس روم مع مسبح', 'سويت روم', 'سويت اوشن روم', 'فيلا مع مسبح'],
    },
    {
        hotelName: 'Apurva Kempinski',
        hotelRoomTypes: ['جراند ديلوكس روم', 'جراند ديلوكس اوشن كورت', 'جراند ديلوكس لاجون روم', 'جونيور سويت مع مسبح خاص على المنحدر', 'جونيور سويت مع مسبح اوشن خاص على المنحدر', 'فيلا سنجاساري', 'فيلا سريواجايا مع مسبح خاص'],
    },
    {
        hotelName: 'The Nest',
        hotelRoomTypes: ['ديلوكس روم', 'سويت روم', 'تنفيذي روم'],
    },
    {
        hotelName: 'Agranusa Signature',
        hotelRoomTypes: ['فيلا', 'فيلا مع مسبح خاص'],
    },





    /* Seminyak */
    {
        hotelName: 'The Trans Bali',
        hotelRoomTypes: ['بريمير روم بإطلالة على المسبح', 'بريمير التومنت', 'بريمير كلوب روم', 'فيلا مسبح'],
    },
    {
        hotelName: 'Indigo Bali',
        hotelRoomTypes: ['ستاندر رووم', 'ستاندر رووم بإطلالة على الحديقة', 'ستاندر رووم كورتيارد اكسس', 'ستاندر رووم بإطلالة جزئية على المحيط', 'سويت روم بإطلالة على الحديقة', 'فيلا وانجسا مع مسبح خاص'],
    },
    {
        hotelName: 'Sini Vie Villa',
        hotelRoomTypes: ['الوفت روم', 'الوفت بلكوني روم'],
    },
    {
        hotelName: 'Impiana Villa',
        hotelRoomTypes: ['فيلا مع مسبح خاص'],
    },
    {
        hotelName: 'Aleva Villa',
        hotelRoomTypes: ['فيلا رويال مع مسبح خاص'],
    },
    {
        hotelName: 'Monolocale Resort',
        hotelRoomTypes: ['فيلا مع مسبح خاص', 'فيلا جراند مع مسبح خاص', 'فيلا رويال مع مسبح خاص', 'جناح سمنياك دبل', 'جناح سمنياك توين'],
    },
    {
        hotelName: 'Ize Seminyak',
        hotelRoomTypes: ['ديلوكس روم', 'ديلوكس جاكوزي', 'كلوب روم', 'ديلوكس روم مع مسبح', 'جونيور سويت'],
    },
    {
        hotelName: 'Mamaka By Ovolo',
        hotelRoomTypes: ['بالي هاي روم', 'كوكومو روم', 'سمر جاردين تراس', 'سواجر سويت'],
    },





    /* Kuta */
    {
        hotelName: 'Aryaduta Kuta',
        hotelRoomTypes: ['ديلوكس روم', 'ديلوكس بريمير روم', 'سوبريور روم', 'جراند ديلوكس روم', 'جراند ديلوكس بريمير', 'تنفيذي روم', 'فاميلي روم'],
    },
    {
        hotelName: 'Tribe',
        hotelRoomTypes: ['كومفورت بلكوني', 'كومفورت XL بلكوني'],
    },
    {
        hotelName: 'Aloft Kuta',
        hotelRoomTypes: ['الوفت', 'الوفت بإطلالة على المسبح'],
    },
    {
        hotelName: 'Paasha Atelier',
        hotelRoomTypes: ['كومفورت بلكوني', 'كومفورت XL بلكوني'],
    },
    {
        hotelName: 'Paasha Atelier',
        hotelRoomTypes: ['سوبريور بلكوني', 'سوبريور بلوكوني بإطلالة على المسبح', 'ديلوكس روم', 'ديلوكس روم مع مسبح', 'ديلوكس سويت مع مسبح', 'جونيور سويت'],
    },




    /* Jimbaran */
    {
        hotelName: 'Movenpick Jimbaran',
        hotelRoomTypes: ['كلاسيك روم', 'كلاسيك روم بإطلالة على المسبح', 'جونيور سويت', 'فاميلي دوبلاكس روم', 'فاميلي دوبلاكس روم بإطلالة على المسبح', 'بريميوم سويت روم', 'جيمباران سويت مع مسبح'],
    },
    {
        hotelName: 'Platinum Jimbaran',
        hotelRoomTypes: ['اوشن روم بإطلالة على المحيط', 'ديلوكس روم بإطلالة على المحيط', 'ديلوكس فاميلي بإطلالة على المحيط', 'فاميلي سويت بإطلالة على المحيط', 'تنفيذي سويت بإطلالة على المحيط', 'بزنس روم بإطلالة على المحيط', 'جيمباران روم بإطلالة على المحيط', 'بنتهاوس بإطلالة على المحيط'],
    },






    /* Uluwatu */
    {
        hotelName: 'Umana Bali',
        hotelRoomTypes: ['فيلا تروبيكال جاردن مع مسبح', 'فيلا اوشن مع مسبح', 'فيلا اوشن جزئية مع مسبح', 'فيلا بانورميك اوشن مع مسبح'],
    },












    /* Jakarta */
    {
        hotelName: 'Ascott Jakarta',
        hotelRoomTypes: ['ستوديو بريمير روم مع مسبح خاص بإطلالة على المدينة', 'تنفيذي روم مع مسبح خاص بإطلالة على المدينة'],
    },
    {
        hotelName: 'Citadines Sudirman',
        hotelRoomTypes: ['ديلوكس روم بإطلالة على المدينة', 'ستوديو تنفيذي', 'فاميلي سويت'],
    },
    {
        hotelName: 'Hilton DoubleTree',
        hotelRoomTypes: ['جيست روم بإطلالة على المدينة', 'ديلوكس روم بإطلالة على المدينة', 'جناح كينغ تنفيذي بإطلالة على المدينة'],
    },
    {
        hotelName: 'Parkroyal Serviced Suites',
        hotelRoomTypes: ['سويت روم', 'ديلوكس سويت روم', 'بريمير سويت روم', 'ستوديو سويت', 'تنفيذي سويت'],
    },
    {
        hotelName: 'Somerset Sudirman',
        hotelRoomTypes: ['تنفيذي روم بإطلالة على المدينة', 'ستوديو تنفيذي بإطلالة على المدينة', 'ستوديو بريمير بإطلالة على المدينة', 'تنفيذي سويت بإطلالة على المدينة', 'كلوب روم بإطلالة على المدينة', 'كلاسيك روم بإطلالة على المدينة'],
    },
    {
        hotelName: 'Aloft Wahied Hasiem',
        hotelRoomTypes: ['الوفت روم بإطلالة على المدينة'],
    },
    {
        hotelName: 'Ascott Sudirman',
        hotelRoomTypes: ['بريمير روم بإطلالة على المدينة', 'ديلوكس روم بإطلالة على المدينة', 'سويت روم بإطلالة على المدينة', 'ستوديو بريمير'],
    },
    {
        hotelName: 'Vertu Harmoni',
        hotelRoomTypes: ['سوبريور روم بإطلالة على المدينة', 'ڤي روم بإطلالة على المدينة', 'فيرتو روم بإطلالة على المدينة', 'فيرتو تنفيذي روم بإطلالة على المدينة', 'فيرتو سويت بإطلالة على المدينة'],
    },
    {
        hotelName: 'Pan Pacific',
        hotelRoomTypes: ['بريمير روم بإطلالة على المدينة', 'ديلوكس روم بإطلالة على المدينة', 'جناح بإطلالة على المدينة'],
    },








    /* Puncak */
    {
        hotelName: 'Grand Aston',
        hotelRoomTypes: ['ديلوكس روم مونتن بإطلالة على الجبل', 'جونيور سويت بإطلالة على الجبل', 'جونيور سويت بإطلالة على الجبل والمسبح', 'جونيور سويت مع مسبح بإطلالة على الجبل', 'ستوديو ديلوكس بإطلالة على الجبل', 'جاردن روم بإطلالة على الجبل ', 'جاردن روم مع مسبح بإطلالة على الجبل', 'ديلوكس روم بإطلالة على الجبل', 'بانوراميك روم بإطلالة على الجبل', 'تنفيذي سويت بإطلالة على الجبل', 'تنفيذي سويت بإطلالة على المسبح'],
    },
    {
        hotelName: 'Le Eminence',
        hotelRoomTypes: ['جونيور سويت بإطلالة على الجبل', 'جونيور سويت بإطلالة على الجبل والنهر', 'جونيور سويت مع شرفة بإطلالة على الجبل', 'رويال سويت', 'رويال سويت مع مسبح', 'ايميننس سويت'],
    },









    /* Bandung */
    {
        hotelName: 'Courtyard Marriott',
        hotelRoomTypes: ['ديلوكس روم بإطلالة على المسبح', 'ديلوكس روم بإطلالة على المدينة', 'بريمير روم', 'بريمير سويت', 'التنفيذي سويت', 'كوربورات سويت', 'كورتيارد سويت', 'رويال سويت'],
    },
    {
        hotelName: 'The Trans Luxury',
        hotelRoomTypes: ['بريمير روم بإطلالة على المدينة'],
    },









    /* Lombok */
    {
        hotelName: 'Kalandara',
        hotelRoomTypes: ['فيلا مع مسبح خاص بإطلالة على المحيط'],
    },


];


